vquadrado/can_esp32/firmware/reader/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
CONFIG_FREERTOS_HZ=1000
CONFIG_READER_TWAI_TX_GPIO=4
CONFIG_READER_TWAI_RX_GPIO=5
CONFIG_READER_ALLOW_TX=n
CONFIG_READER_STATS_PERIOD_S=1
